CSI API ETABS v1
cPropMaterial.GetOSteel Method
 (NEWER FUNCTION AVAILABLE) Retrieves the other material property data for steel materials.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOSteel(
	string Name,
	ref double Fy,
	ref double Fu,
	ref double EFy,
	ref double EFu,
	ref int SSType,
	ref int SSHysType,
	ref double StrainAtHardening,
	ref double StrainAtMaxStress,
	ref double StrainAtRupture,
	double Temp = 0
)
Function GetOSteel (
	Name As String,
	ByRef Fy As Double,
	ByRef Fu As Double,
	ByRef EFy As Double,
	ByRef EFu As Double,
	ByRef SSType As Integer,
	ByRef SSHysType As Integer,
	ByRef StrainAtHardening As Double,
	ByRef StrainAtMaxStress As Double,
	ByRef StrainAtRupture As Double,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim Fy As Double
Dim Fu As Double
Dim EFy As Double
Dim EFu As Double
Dim SSType As Integer
Dim SSHysType As Integer
Dim StrainAtHardening As Double
Dim StrainAtMaxStress As Double
Dim StrainAtRupture As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.GetOSteel(Name,
	Fy, Fu, EFy, EFu, SSType, SSHysType,
	StrainAtHardening, StrainAtMaxStress,
	StrainAtRupture, Temp)
int GetOSteel(
	String^ Name,
	double% Fy,
	double% Fu,
	double% EFy,
	double% EFu,
	int% SSType,
	int% SSHysType,
	double% StrainAtHardening,
	double% StrainAtMaxStress,
	double% StrainAtRupture,
	double Temp = 0
)
abstract GetOSteel :
        Name : string *
        Fy : float byref *
        Fu : float byref *
        EFy : float byref *
        EFu : float byref *
        SSType : int byref *
        SSHysType : int byref *
        StrainAtHardening : float byref *
        StrainAtMaxStress : float byref *
        StrainAtRupture : float byref *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing steel material property.
Fy
Type: System.Double
Fu
Type: System.Double
The minimum tensile stress. [F/L2]
EFy
Type: System.Double
EFu
Type: System.Double
SSType
Type: System.Int32
This is 0 or 1, indicating the stress-strain curve type.
Value | SSType
0 | User defined
1 | Parametric - Simple
SSHysType
Type: System.Int32
This is 0 through 7, indicating the stress-strain curve type.
Value | SSHysType
0 | Elastic
1 | Kinematic
2 | Takeda
3 | Pivot
4 | Concrete
5 | BRB Hardening
6 | Degrading
7 | Isotropic
StrainAtHardening
Type: System.Double
This item applies only when parametric stress-strain curves are used. It is the strain at the onset of strain hardening.
StrainAtMaxStress
Type: System.Double
This item applies only when parametric stress-strain curves are used. It is the strain at the maximum stress. This item must be larger than the StrainAtHardening item.
StrainAtRupture
Type: System.Double
This item applies only when parametric stress-strain curves are used. It is the strain at rupture. This item must be larger than the StrainAtMaxStress item.
Temp (Optional)
Type: System.Double
The temperature at which the specified data is to be retrieved. The temperature must have been defined previously for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Fy As Double
       Dim Fu As Double
       Dim eFy As Double
       Dim eFu As Double
       Dim SSType As Integer
       Dim SSHysType As Integer
       Dim StrainAtHardening As Double
       Dim StrainAtMaxStress As Double
       Dim StrainAtRupture As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Steel", eMatType.Steel)
   'assign other properties
       ret = SapModel.PropMaterial.SetOSteel_1("Steel", 55, 68, 60, 70, 1, 2, 0.02, 0.1, 0.2)
   'get other properties
       ret = SapModel.PropMaterial.GetOSteel_1("Steel", Fy, Fu, eFy, eFu, SSType, SSHysType, StrainAtHardening, StrainAtMaxStress, StrainAtRupture)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace